template/stator_orig/0_org/U
// -*- C++ -*-
// File generated by PyFoam - sorry for the ugliness

FoamFile
{
 version 2.0;
 format ascii;
 class volVectorField;
 location "0";
 object U;
}

dimensions [ 0 1 -1 0 0 0 0 ];

internalField uniform (6 0 0);

boundaryField
{

  inlet
  {
    type fixedValue;
    value $internalField;
  }

  outlet
  {
        type            inletOutlet;
        inletValue      $internalField;
        value           $internalField;
  }

  side
  {
	type slip;
  }

  blades
  {
    //type noSlip;
    type            movingWallVelocity; //From simpleRotor Tutorial
//    uniformValue    (0 0 0);
    value uniform	    (0 0 0);
  }



  overset1
  {
    type            overset;
  }

  overset2
  {
    type            overset;
  }

  overset3
  {
    type            overset;
  }

} 	// ************************************************************************* //

