template/stator_orig/constant/dynamicMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1906                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      dynamicMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dynamicFvMesh       dynamicOversetFvMesh;

//motionSolverLibs ( "libfvMotionSolvers.so" );
//
//solver          displacementLaplacian;
//
//displacementLaplacianCoeffs
//{
//    diffusivity     uniform 1;
//}

solver          multiSolidBodyMotionSolver;

multiSolidBodyMotionSolverCoeffs
{
    region1
    {
        solidBodyMotionFunction rotatingMotion;
        rotatingMotionCoeffs
        {
            origin      (0 0 0);
            axis        (1 0 0);
            omega       -1.3;
        }
    }

    region2
    {
        solidBodyMotionFunction rotatingMotion;
        rotatingMotionCoeffs
        {
            origin      (0 0 0);
            axis        (1 0 0);
            omega       -1.3;
        }
    }

    region3
    {
        solidBodyMotionFunction rotatingMotion;
        rotatingMotionCoeffs
        {
            origin      (0 0 0);
            axis        (1 0 0);
            omega       -1.3;
        }
    }

}

// ************************************************************************* //
